package org.example.backendspring.Enun;

public enum CurrencyId {

        // Часто используемые мировые валюты
        USD, // Доллар США
        EUR, // Евро
        GBP, // Фунт стерлингов
        JPY, // Японская йена
        CHF, // Швейцарский франк
        CAD, // Канадский доллар
        AUD, // Австралийский доллар
        NZD, // Новозеландский доллар
        CNY, // Китайский юань
        SEK, // Шведская крона
        NOK, // Норвежская крона
        SGD, // Сингапурский доллар
        HKD, // Гонконгский доллар
        KRW, // Южнокорейская вона
        INR, // Индийская рупия

        // Валюты Европы
        PLN, // Польский злотый
        CZK, // Чешская крона
        HUF, // Венгерский форинт
        DKK, // Датская крона
        RON, // Румынский лей
        BGN, // Болгарский лев
        HRK, // Хорватская куна
        ISK, // Исландская крона
        TRY, // Турецкая лира
        RSD, // Сербский динар
        MKD, // Македонский денар
        GEL, // Грузинский лари
        BYN, // Белорусский рубль
        UAH, // Украинская гривна
        RUB, // Российский рубль

        // Крепкие валюты
        AED, // Дирхам ОАЭ
        SAR, // Саудовский риял
        QAR, // Катарский риал
        KWD, // Кувейтский динар
        BHD, // Бахрейнский динар
        OMR, // Оманский риал
        JOD, // Иорданский динар
        TWD, // Тайваньский доллар
        ILS, // Израильский шекель
        KZT, // Казахский тенге

}
